app/controllers/fotos_controller.rb

SELECT "fotos".* FROM "fotos" ORDER BY "fotos"."ordem" ASC, "desc" ASC
SELECT MAX("fotos"."ordem") FROM "fotos"
---
  def index
    @fotos = Foto.order(ordem: :desc)

INSERT INTO "fotos" ("ordem", "imagem", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["ordem", 1], ["imagem", "1711220076WhatsApp Image 2024-03-23 at 15.53.10 (1).jpeg"], ["created_at", "2024-03-23 18:54:36.294047"], ["updated_at", "2024-03-23 18:54:36.294047"]]
DELETE FROM "fotos" WHERE "fotos"."id" = ?  [["id", 11]]
---
  def create
    @foto = Foto.new(foto_params)

    if @foto.save
      redirect_to fotos_path, notice: 'Foto was successfully uploaded.'
    else
      # In case the client request fails but an image was create
      if @foto.imagem != nil
        File.delete(Rails.root.join('app', 'assets', 'images', @foto.imagem))

SELECT "fotos".* FROM "fotos" WHERE "fotos"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
  def show
    @foto = Foto.find(params[:id])

SELECT "fotos".* FROM "fotos" ORDER BY "fotos"."ordem" DESC
UPDATE "fotos" SET "ordem" = ?, "updated_at" = ? WHERE "fotos"."id" = ?  [["ordem", 5], ["updated_at", "2024-03-20 17:17:11.549841"], ["id", 15]]
---
  def update_ordem
    lista = params[:lista_ordem].values
    fotos = Foto.order(ordem: :desc)

    lista.each_with_index do |ordem, index|
      # Need an error treatment here
      fotos[index].update_attribute(:ordem, ordem)

SELECT "fotos".* FROM "fotos" WHERE "fotos"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "fotos" WHERE "fotos"."id" = ?  [["id", 14]]
---
  def destroy
    @foto = Foto.find(params[:id])
    File.delete(Rails.root.join('app', 'assets', 'images', @foto.imagem))

SELECT "fotos".* FROM "fotos" ORDER BY "fotos"."ordem" DESC
SELECT MAX("fotos"."ordem") FROM "fotos"
---
  def carrossel
    # Pode melhorar a performace
    fotos = Foto.order(ordem: :desc)
    @list_fotos = []
    fotos.each do |foto|

SELECT MAX("fotos"."ordem") FROM "fotos"
---
  def foto_params

    # in case the client don't upload a photo
    if not(params[:foto].present?)
      return nil
    end

    imagem = params[:foto][:imagem]
    nome_arquivo = Time.now.to_i.to_s + imagem.original_filename
    arquivo_path = Rails.root.join('app', 'assets', 'images', nome_arquivo)

    File.open(arquivo_path, 'wb') do |file|
      file.write(imagem.read)
    end

    maior_ordem = Foto.maximum(:ordem)